/********************************** (C) COPYRIGHT  *******************************
* File Name          : usb_device.h
* Author             : P1nkDog
* Version            : V1.0.0
* Date               : 2026/10/26
* Description        : USB设备栈初始化接口
*********************************************************************************/

#ifndef USB_DEVICE_H
#define USB_DEVICE_H

#include <stdbool.h>

//--------------------------------------------------------------------+
// api接口
//--------------------------------------------------------------------+

//初始化USB设备栈（角色与速率在此固定，勿在别处重复配置）
bool usb_device_init(void);

#endif //_USB_DEVICE_H_
